IRP/src/Catalogs/CashAccounts/CashAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>CashAccounts</name>
 <hierarchical>true</hierarchical>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CashAccountTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>BankName</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>150</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Number</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>64</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>TransitAccount</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_CommissionIsSeparate</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ReceiptingAccount</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>IntegrationSetting</name>
  <type>
   <types>CatalogRef.IntegrationSettings</types>
  </type>
 </attributes>
 <attributes>
  <name>CashAccount</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>FinancialMovementType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Acquiring</name>
  <type>
   <types>CatalogRef.Hardware</types>
  </type>
 </attributes>
 <attributes>
  <name>BankCountry</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>BankIdentifierCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>9</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>BankSWIFTCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>11</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>isIBAN</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>NegativeBalanceControl</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/CashAccountTypes/CashAccountTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>CashAccountTypes</name>
 <enumValues>
  <name>Bank</name>
 </enumValues>
 <enumValues>
  <name>Cash</name>
 </enumValues>
 <enumValues>
  <name>Transit</name>
 </enumValues>
 <enumValues>
  <name>POS</name>
 </enumValues>
 <enumValues>
  <name>POSCashAccount</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/CashAccounts/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	IsBankAccount    = Type = PredefinedValue("Enum.CashAccountTypes.Bank");
	IsPOSAccount     = Type = PredefinedValue("Enum.CashAccountTypes.POS");		
	IsPOSCashAccount = Type = PredefinedValue("Enum.CashAccountTypes.POSCashAccount");
	
	If Not IsBankAccount And Not IsPOSAccount Then
		ThisObject.BankName = "";
		ThisObject.Number = "";
	EndIf;
	If Not IsBankAccount Then
		ThisObject.TransitAccount = Undefined;
		ThisObject.CommissionIsSeparate = False;
	EndIf;
	If Not IsPOSAccount Then
		ThisObject.ReceiptingAccount = Undefined;
		ThisObject.Acquiring = Undefined;
	EndIf;
	If Not IsPOSCashAccount Then
		ThisObject.CashAccount = Undefined;
		ThisObject.FinancialMovementType = Undefined;
	EndIf;
	
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If TypeOf(FillingData) = Type("Structure") Then
		FillPropertyValues(ThisObject, FillingData);
	EndIf;
	If Not ValueIsFilled(Type) Then
		Type = Enums.CashAccountTypes.Cash;
	EndIf;
EndProcedure

Procedure OnCopy(CopiedObject)
	Acquiring = Catalogs.Hardware.EmptyRef();
EndProcedure
